Use test;

DROP TABLE IF EXISTS parts;

CREATE TABLE `test`.`parts` (
  `id` INT(8) NOT NULL AUTO_INCREMENT,
  `name` VARCHAR(45) NOT NULL,
  `number` INT NOT NULL,
  `isNeed` BIT(1) NOT NULL,
  PRIMARY KEY (`id`))
  ENGINE = InnoDB
  DEFAULT CHARACTER SET = utf8;


INSERT INTO test.parts (`id`,`name`, `number`, `isNeed`) VALUES

  (1,'Процессор', '5', 1),
  (2, 'Материнская плата', '10', 1),
  (3,'Оперативная память', '8', 1),
  (4,'Жесткий диск', '6', 1),
  (5, 'Видеокарта', '1', 0),
  (6,'Корпус', '5', 1),
  (7,'Блок питания', '8', 1),
  (8, 'Кулер для процессора', '6', 1),
  (9,'Оптический привод', '8', 0),
  (10,'Звуковая карта', '2', 0),
  (11, 'Сетевая карта', '7', 0),
  (12,'Термопаста', '1', 0),
  (13,'Мышка', '20', 0),
  (14, 'Клавиатура', '3', 0),
  (15,'Колонки', '8', 0),
  (16,'Принтер', '9', 0),
  (17, 'Монитор', '5', 1),
  (18,'Сканер', '4', 0),
  (19,'Роутер', '6', 0),
  (20,'Вентилятор','0',0),
  (21,'Веб-камера', '5', 0),
  (22,'Коврик для мышки', '2', 0),
  (23,'Наушники', '9', 0),
  (24,'Микрофон', '10', 0),
  (25,'Сетевой фильтр', '15', 0),
  (26,'ИБП', '15', 0),
  (27,'USB-накопитель', '15', 0),
  (28,'Wi-Fi адаптер', '15', 0),
  (29,'Windows 10 Ultimate Edition', '15', 1);
